[
  {
    "slug": "seo-no-nextjs",
    "titulo": "SEO Dinâmico no Next.js",
    "autor": "Francisca Jacqueline",
    "data": "2026-01-21",
    "conteudo": "O Next.js oferece uma forma poderosa de trabalhar com SEO utilizando a função generateMetadata.\n\nCom ela, é possível definir títulos e descrições dinâmicas por rota, permitindo que cada página tenha metadados específicos e otimizados para mecanismos de busca.\n\nNo App Router, essa funcionalidade se integra de forma natural aos Server Components, eliminando a necessidade de bibliotecas externas para controle de SEO.\n\nNeste artigo, você aprendeu como aplicar SEO dinâmico em rotas estáticas e dinâmicas, seguindo as melhores práticas recomendadas pelo Next.js."
  },
  {
    "slug": "app-router-na-pratica",
    "titulo": "App Router na prática",
    "autor": "Francisca Jacqueline",
    "data": "2026-01-20",
    "conteudo": "O App Router é uma das maiores evoluções do Next.js. Ele permite trabalhar com Server Components, layouts aninhados e carregamento de dados de forma mais eficiente."
  },
  {
    "slug": "rotas-dinamicas-no-nextjs",
    "titulo": "Rotas Dinâmicas no Next.js",
    "autor": "Francisca Jacqueline",
    "data": "2026-01-22",
    "conteudo": "As rotas dinâmicas no Next.js permitem criar páginas flexíveis a partir de parâmetros da URL, tornando a aplicação mais escalável e organizada.\n\nNo App Router, basta criar uma pasta com colchetes, como [slug], para que o Next.js entenda que aquele trecho da rota será dinâmico. Esse padrão facilita a criação de páginas de artigos, produtos ou perfis de usuários.\n\nDentro da rota dinâmica, é possível acessar os parâmetros por meio da propriedade params, o que permite buscar dados específicos de acordo com o valor recebido na URL.\n\nEssa abordagem melhora a reutilização de código, reduz a duplicação de páginas e se integra perfeitamente com recursos como generateStaticParams e generateMetadata, resultando em aplicações performáticas e bem estruturadas."
  }
]
